# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name：     str_learn
   Description :
   Author :       bing
   date：          2021/7/8
-------------------------------------------------
   Change Activity:
                   2021/7/8:
-------------------------------------------------
"""
__author__ = 'bing'
# "" 双引号下的特殊字符不需要转移
# 例
print("That isn't a horse")
# 单引号需要转义
print('That isn\'t a horse')
# ord函数将单个字符（字符！） 转化为整数
# chr函数将整数转化为字符

# bytes函数将字符串（字符串！）转化为字节类型（bytes）
# str函数将字节类型（bytes） 转化为字符串
s = "python"
sa = bytes(s, encoding='utf8')
s = str(sa, encoding='utf8')

# 字符串格式化
# 1.保留小数点后两位
print("{:.2f}".format(3.1415926))
# 2. 带符号保留小数点后2位
print("{:+.2f}".format(-1))
# 3.不带小数位
print("{:.0f}".format(2.718))
# 4. 整数补0，填充左边，宽度为3
print("{:0>3d}".format(5))
# >>> 005
# 5. 以逗号分隔的数字格式（按照美式分隔，以1000为分隔）
print("{:,}".format(10241024))
# >>> 10,241,024
# 6. 百分比格式
print("{:.2%}".format(0.718))
# >>> 71.8%
# 7.指数记法
print("{:.2e}".format(10241024))
# >>> 1.02e+07
###################################################################
# 问题已知下面一个长句，将其转化为多行，每行只有11个字符。
words = '是想与朋友们分享一个再普通不过的道理：脚踏实地做些实事，哪怕是不起眼的小事，每天前进一点，日积月累会做出一点成绩的。'
# 借助于内置的textwrap模块中的fill方法
import textwrap
r = textwrap.fill(words, 11)
print(r)


###########################################################################
# 关于对齐
# 利用内置函数
# 左对齐字符串 ljust
text = "Hello World"
text.ljust(20)
# 右对齐 rjust
# 中间对齐 center

# 利用format
# 右对齐
format(text, '>20')
# 左对齐
format(text, '<20')
# 中间对齐
format(text, '^20')

# 中间对齐字符串，并用-填充
# 使得总长度为 20
format(text, '-^20')

